<footer class="footer">
	<div class="container">

		<div class="footer__top">
			<div class="footer__wrapper">

				<div class="footer__info">
					<a class="footer__info-logo" href="<?php echo esc_url(home_url('/')); ?>"><img src="<?php echo bloginfo('template_url'); ?>/assets/icons/logo-white.svg"
							alt="ХимАгрегаты"></a>
					<div class="footer__info-descr">
						<?php
						$site_description = get_field('site_short_description', 'option');
						echo !empty($site_description) ? esc_html($site_description) : 'Информационный портал отраслевого журнала о химическом и нефтехимическом машиностроении, промышленном оборудовании и технологиях.';
						?>
					</div>

					<div class="footer__info-socials socials-block">
						<a href="<?php echo esc_url(get_field('social_vk', 'option')); ?>" target="_blank">
							<svg width="30" height="17" viewBox="0 0 30 17" fill="none"
								xmlns="http://www.w3.org/2000/svg">
								<path fill-rule="evenodd" clip-rule="evenodd"
									d="M15.0304 16.9388H16.7561C16.7561 16.9388 17.2772 16.8813 17.5437 16.5947C17.7886 16.3311 17.7808 15.8366 17.7808 15.8366C17.7808 15.8366 17.747 13.5211 18.8215 13.1801C19.8812 12.844 21.2416 15.418 22.6834 16.4078C23.7738 17.1566 24.6024 16.9927 24.6024 16.9927L28.4581 16.9388C28.4581 16.9388 30.475 16.8144 29.5186 15.2286C29.4403 15.099 28.9615 14.0555 26.6517 11.9116C24.2339 9.66759 24.558 10.0306 27.4702 6.14911C29.2438 3.78526 29.9527 2.3422 29.7312 1.72417C29.5201 1.13532 28.2155 1.29087 28.2155 1.29087L23.8744 1.31771C23.8744 1.31771 23.5523 1.27389 23.3138 1.41663C23.0804 1.55622 22.9307 1.88236 22.9307 1.88236C22.9307 1.88236 22.2433 3.71145 21.3273 5.26725C19.3942 8.54966 18.6211 8.72341 18.3052 8.51927C17.57 8.04418 17.7537 6.61108 17.7537 5.59269C17.7537 2.41154 18.2362 1.0852 16.8141 0.741868C16.3423 0.628001 15.9947 0.552666 14.7878 0.540364C13.2387 0.524606 11.9279 0.545143 11.1855 0.908805C10.6917 1.15067 10.3106 1.6895 10.5428 1.72051C10.8298 1.75874 11.4795 1.89589 11.8239 2.36457C12.2689 2.96999 12.2534 4.32907 12.2534 4.32907C12.2534 4.32907 12.509 8.07376 11.6564 8.53878C11.0713 8.85781 10.2685 8.20654 8.54506 5.22852C7.66219 3.70311 6.99536 2.01677 6.99536 2.01677C6.99536 2.01677 6.86695 1.7017 6.63759 1.53304C6.35943 1.32869 5.97076 1.26393 5.97076 1.26393L1.84533 1.29087C1.84533 1.29087 1.22618 1.30815 0.998651 1.57747C0.796233 1.8172 0.982488 2.31241 0.982488 2.31241C0.982488 2.31241 4.21203 9.86848 7.86918 13.6763C11.2229 17.1679 15.0304 16.9388 15.0304 16.9388Z"
									fill="white" />
							</svg>
						</a>
						<a href="<?php echo esc_url(get_field('social_youtube', 'option')); ?>" target="_blank">
							<svg width="29" height="20" viewBox="0 0 29 20" fill="none"
								xmlns="http://www.w3.org/2000/svg">
								<path fill-rule="evenodd" clip-rule="evenodd"
									d="M12.0987 5.75352L19.2978 9.99928C19.1771 10.1265 18.5681 10.4633 18.3949 10.5674L15.699 12.1503C15.0857 12.5175 14.4809 12.8558 13.8733 13.2244C13.3125 13.5656 12.6808 13.9501 12.0888 14.2537L12.0973 5.75497L12.0987 5.75352ZM0.886225 9.71015L0.933074 12.3556C0.928815 13.1579 1.1517 15.0835 1.25108 15.7832C1.4768 17.3733 1.98504 18.6484 3.61055 19.2945C3.93708 19.4246 4.38285 19.5128 4.76048 19.5663C6.03249 19.7456 6.91552 19.7542 8.11372 19.854C8.5311 19.8887 9.82441 19.88 10.2489 19.9393C10.6166 19.9899 15.6805 20 16.6104 20C17.1328 20 17.4863 19.9508 17.9789 19.9523C18.4304 19.9537 18.9528 19.9769 19.3958 19.9523C19.63 19.9393 19.7563 19.9017 20.0559 19.9031L23.4219 19.7239C24.1985 19.6184 25.0659 19.6516 25.9177 19.3813C26.9413 19.056 27.7547 18.3159 28.1579 17.3357C28.5355 16.4163 28.5909 15.2223 28.7101 14.2927C28.7953 13.6379 28.8848 11.6415 28.8848 10.8652C28.8848 9.09143 28.8833 8.13733 28.7456 6.34333C28.6647 5.2996 28.5455 3.49982 28.1153 2.56306C27.6497 1.55114 26.7822 0.850018 25.6749 0.576798C24.8771 0.380195 23.9642 0.371521 23.111 0.254427C22.6766 0.193712 22.157 0.218287 21.707 0.193712C21.4727 0.180701 21.3464 0.143115 21.0468 0.144561C20.8026 0.146006 20.5443 0.164799 20.3043 0.13155L14.6257 0C13.6617 0 12.7929 0.0477051 11.7921 0.0477051C10.4093 0.0477051 5.99558 0.247199 4.90528 0.439465C4.48648 0.513191 4.07052 0.54644 3.69005 0.692447C2.95609 0.975786 2.47341 1.35598 2.03899 1.9429C1.32774 2.90278 1.23972 4.20817 1.08782 5.44561L0.931654 7.49837C0.924556 7.74991 0.947271 8.02024 0.933074 8.26888C0.920297 8.50741 0.883386 8.63607 0.884805 8.94109C0.886225 9.19696 0.884805 9.45428 0.884805 9.71015H0.886225Z"
									fill="white" />
							</svg>
						</a>
						<a href="<?php echo esc_url(get_field('social_facebook', 'option')); ?>" target="_blank">
							<svg width="15" height="27" viewBox="0 0 15 27" fill="none"
								xmlns="http://www.w3.org/2000/svg">
								<path fill-rule="evenodd" clip-rule="evenodd"
									d="M5.03773 10.3016L0.886558 10.3025L0.884766 15.1896H5.02697L5.03862 26.9972L10.1503 27L10.1557 15.1914L13.9628 15.1905L14.6993 10.3081L10.1566 10.3034C10.1458 9.41605 10.1557 8.52313 10.1557 7.63668C10.1557 6.73821 10.1843 6.08469 10.6234 5.45243C11.3267 4.44027 12.505 4.4985 13.5703 4.4985C14.0085 4.4985 14.4466 4.4985 14.8848 4.4985V0.336145C12.8051 -0.00956234 10.2103 -0.307204 8.26243 0.614375C7.70691 0.877815 7.16752 1.24848 6.75088 1.67276C5.84233 2.59803 5.32893 3.85977 5.1327 5.18899C4.96694 6.31023 5.05654 8.98808 5.03683 10.3016H5.03773Z"
									fill="white" />
							</svg>
						</a>
						<a href="<?php echo esc_url(get_field('social_instagram', 'option')); ?>" target="_blank">
							<svg width="25" height="24" viewBox="0 0 25 24" fill="none"
								xmlns="http://www.w3.org/2000/svg">
								<path fill-rule="evenodd" clip-rule="evenodd"
									d="M10.9492 8.58054C11.3479 8.05984 12.9739 7.82193 13.7135 8.10958C17.9442 8.90659 17.8838 15.2113 13.5889 15.9337C10.4388 16.4636 7.9863 13.3361 9.24062 10.3925C9.54273 9.68305 10.2829 8.77304 10.9492 8.58054ZM3.10177 7.71595C3.32781 6.42743 3.12982 5.68233 3.75887 4.51223L3.97089 4.2554C4.18722 3.62601 4.73804 3.26049 5.30127 2.91065C6.89384 2.0812 9.05611 2.16987 11.0074 2.17961L12.5423 2.16447C14.0901 2.16825 19.3852 2.00442 20.2689 2.83549C23.0925 3.96503 22.6663 8.06362 22.7041 11.4993C22.7235 13.2712 22.7117 15.1334 22.6275 16.8853C22.4257 21.0661 20.0007 21.7528 16.5372 21.8101C14.4057 21.8458 7.69768 22.0356 6.01123 21.4122C4.20287 20.7438 4.00541 19.8846 3.39039 18.6167C3.05213 16.8318 3.11364 15.1123 3.0845 13.2334C3.06832 12.186 3.25229 8.3767 3.10177 7.71703V7.71595ZM8.10229 24H17.6901C18.3947 23.6875 20.4722 23.9897 22.3615 22.4471C25.3163 20.0339 24.8556 16.13 24.8626 12.3196C24.8669 10.1973 24.8664 8.12581 24.7213 6.02352L24.5842 4.99293C24.2309 4.59172 23.877 1.31014 19.6884 0.308205C18.959 0.134096 17.1878 0.12166 16.8377 0H8.87484C8.16218 0.248727 6.81561 -0.136259 4.79684 0.736449C0.443164 2.61812 0.930323 7.51751 0.92331 11.5891C0.915757 16.0521 0.309911 20.6471 4.18992 22.958C5.97401 24.0205 7.29198 23.6366 8.10283 23.9995L8.10229 24ZM17.9431 4.98536C17.7489 5.91051 17.9685 6.57018 18.665 6.89893C19.0178 7.06547 19.4656 7.07088 19.82 6.94111C20.2716 6.77565 20.3045 6.52422 20.5424 6.38796C20.8013 5.5066 20.6826 4.71338 19.9667 4.32028C19.5988 4.11805 19.1149 4.10346 18.7065 4.27757C18.1444 4.5171 18.1843 4.73879 17.9426 4.98536H17.9431ZM10.0677 6.44798C9.83244 6.70914 9.49148 6.85892 9.20123 7.06817C8.85164 7.32069 8.79068 7.47587 8.4972 7.73109C8.03971 8.12959 7.60489 8.71897 7.35942 9.39918C6.95264 9.74578 6.7266 11.5258 6.7471 12.2293C6.76274 12.7759 6.85392 13.2696 6.9985 13.7589C7.13661 14.2266 7.36373 14.5743 7.47109 14.9918C7.4835 15.0031 7.50022 15.022 7.50562 15.0285L7.61136 15.1545C7.61945 15.1653 7.70631 15.2951 7.71818 15.3124C8.55601 16.5993 9.38304 16.9578 9.58805 17.2941C9.99266 17.3292 10.5516 17.7364 11.0716 17.8624C13.1864 18.8741 16.9915 17.6012 18.3073 14.9161L18.8371 13.8525L18.8797 13.414L19.0334 12.1368L19.027 10.9321C18.8619 10.7299 18.9557 10.8569 18.8619 10.5325C18.8198 10.3871 18.7885 10.2497 18.7421 10.1043C18.6353 9.76795 18.5398 9.54734 18.4249 9.21696C18.2102 9.12017 17.5811 7.23525 15.1863 6.28036C12.4527 5.19029 10.6336 6.39391 10.0671 6.4469L10.0677 6.44798Z"
									fill="white" />
							</svg>
						</a>
					</div>

				</div>

				<nav class="footer__nav">

					<?php
					wp_nav_menu([
						'theme_location'  => 'footer-menu-1',
						'container'       => false,
						'menu_class'      => '',
						'echo'            => true,
						'fallback_cb'     => false,
						'items_wrap'      => '<ul class="footer__nav-list">%3$s</ul>',
						'depth'           => 1,
					]);
					?>

					<?php
					wp_nav_menu([
						'theme_location'  => 'footer-menu-2',
						'container'       => false,
						'menu_class'      => '',
						'echo'            => true,
						'fallback_cb'     => false,
						'items_wrap'      => '<ul class="footer__nav-list">%3$s</ul>',
						'depth'           => 1,
					]);
					?>

				</nav>

				<div class="footer__contacts">
					<div class="footer__contacts-title">Контакты</div>

					<div class="footer__contacts-info">
						<p class="footer__contacts-adress"><?php echo esc_html(get_field('contact_address', 'option')); ?></p>

						<p class="footer__contacts-tel">
							Тел./факс: <?php echo esc_html(get_field('contact_tel', 'option')); ?>
							<br>
							<?php echo esc_html(get_field('contact_fax', 'option')); ?>
						</p>

						<p class="footer__contacts-mail">E-mail: <?php echo esc_html(get_field('contact_mail', 'option')); ?></p>
					</div>
				</div>

			</div>
		</div>

		<div class="footer__bottom">
			<div class="footer__bottom-copyright">ⓒ АО "Группа компаний "ХИМАГРЕГАТ". Все права защищены.</div>

			<ul class="footer__bottom-info">
				<li><a href="<?php echo esc_url(get_permalink(3)); ?>" target="_blank">Политика конфиденциальности</a></li>
				<li><a href="<?php echo esc_url(get_permalink(309)); ?>" target="_blank">Условия использования</a></li>
				<li><a href="https://avdeevstudio.ru" target="_blank">Разработан AV Studio</a></li>
			</ul>
		</div>

	</div>
</footer>

<div id="subscribe-message" class="subscribe-block__message" role="alertdialog" aria-live="assertive" aria-modal="true">
	<div class="subscribe-block__message-content">
		<button type="button" class="subscribe-block__message-close" id="subscribe-message-close" aria-label="Закрыть уведомление">&times;</button>
		<div class="subscribe-block__message-title"></div>
		<div class="subscribe-block__message-text"></div>
	</div>
</div>

<div class="overlay"></div>

<?php
wp_footer();
?>

<script>
	jQuery(document).ready(function($) {
		setTimeout(function() {
			changeCurrencyOil();
		}, 4000);
	});

	function changeCurrencyOil() {
		if (jQuery('#currency').is(':visible')) {
			console.log('1');
			jQuery('#currency').fadeOut(0, function() {
				jQuery('#oil').fadeIn(0, function() {
					setTimeout(function() {
						changeCurrencyOil();
					}, 4000);
				});
			});
		} else {
			jQuery('#oil').fadeOut(0, function() {
				jQuery('#currency').fadeIn(0, function() {
					setTimeout(function() {
						changeCurrencyOil();
					}, 4000);
				});
			});
		}
	}
</script>

</body>

</html>